In [164]:
import pandas as pd

In [201]:
df1_la_sales = pd.read_csv('/Users/rigel/Course Docs/Spring-2018/CIS9650-python/Class-12/Hw/la_sales.csv')

In [234]:
df2_ny_sales = pd.read_csv('/Users/rigel/Course Docs/Spring-2018/CIS9650-python/Class-12/Hw/ny_sales.csv')

In [203]:
df1_la_sales

   Date    Sales
0   Jan  $8,000
1   Feb  14,000
2   Mar  18,000
3   Apl   9,000
4   May  15,000
5   Jun   7,700
6   Jul  13,500
7   Aug  12,000
8   Sep   9,000
9   Oct   8,000
10  Nov   6,000
11  Dec  19,000

In [204]:
df2_ny_sales

   Date     Sales
0   Jan  $10,000
1   Feb   12,000
2   Mar   11,000
3   Apr   10,000
4   May   15,000
5   Jun    9,000
6   Jul   10,000
7   Aug   11,000
8   Sep    9,000
9   Oct   13,000
10  Nov   16,000
11  Dex    9,000

In [205]:
df1_la_sales.dtypes

Date     object
Sales    object
dtype: object

In [206]:
df1_la_sales.columns.dtypes

AttributeError: 'Index' object has no attribute 'dtypes'

In [208]:
df1_la_sales.Sales = df1_la_sales.Sales.str.lstrip('$')

In [209]:
df1_la_sales

   Date    Sales
0   Jan   8,000
1   Feb  14,000
2   Mar  18,000
3   Apl   9,000
4   May  15,000
5   Jun   7,700
6   Jul  13,500
7   Aug  12,000
8   Sep   9,000
9   Oct   8,000
10  Nov   6,000
11  Dec  19,000

In [210]:
df1_la_sales.Sales = df1_la_sales.Sales.str.replace(',','')

In [211]:
df1_la_sales

   Date   Sales
0   Jan   8000
1   Feb  14000
2   Mar  18000
3   Apl   9000
4   May  15000
5   Jun   7700
6   Jul  13500
7   Aug  12000
8   Sep   9000
9   Oct   8000
10  Nov   6000
11  Dec  19000

In [212]:
df1_la_sales.Sales = pd.to_numeric(df1.Sales,errors = 'raise')

In [213]:
df1_la_sales

   Date  Sales
0   Jan   8000
1   Feb  14000
2   Mar  18000
3   Apl   9000
4   May  15000
5   Jun   7700
6   Jul  13500
7   Aug  12000
8   Sep   9000
9   Oct   8000
10  Nov   6000
11  Dec  19000

In [214]:
df1_la_sales.Sales.dtype

dtype('int64')

In [215]:
df1_la_sales.Sales = df1.Sales.apply(str)

In [216]:
df1_la_sales

   Date  Sales
0   Jan   8000
1   Feb  14000
2   Mar  18000
3   Apl   9000
4   May  15000
5   Jun   7700
6   Jul  13500
7   Aug  12000
8   Sep   9000
9   Oct   8000
10  Nov   6000
11  Dec  19000

In [218]:
df1_la_sales.Sales = df1_la_sales.Sales.str.lstrip('')

In [219]:
df1_la_sales

   Date  Sales
0   Jan   8000
1   Feb  14000
2   Mar  18000
3   Apl   9000
4   May  15000
5   Jun   7700
6   Jul  13500
7   Aug  12000
8   Sep   9000
9   Oct   8000
10  Nov   6000
11  Dec  19000

In [220]:
df1_la_sales.Sales = df1_la_sales.Sales.apply(int)

In [221]:
df1_la_sales.Sales.dtype

dtype('int64')

In [222]:
df1_la_sales.Date.loc[3] = 'Apr'

/Users/rigel/anaconda/lib/python3.6/site-packages/pandas/core/indexing.py:141: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._setitem_with_indexer(indexer, value)

In [223]:
df1_la_sales

   Date  Sales
0   Jan   8000
1   Feb  14000
2   Mar  18000
3   Apr   9000
4   May  15000
5   Jun   7700
6   Jul  13500
7   Aug  12000
8   Sep   9000
9   Oct   8000
10  Nov   6000
11  Dec  19000

In [224]:
df1_la_sales.Date.loc[0] = "JAN"

/Users/rigel/anaconda/lib/python3.6/site-packages/pandas/core/indexing.py:141: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._setitem_with_indexer(indexer, value)

In [225]:
df1_la_sales

   Date  Sales
0   JAN   8000
1   Feb  14000
2   Mar  18000
3   Apr   9000
4   May  15000
5   Jun   7700
6   Jul  13500
7   Aug  12000
8   Sep   9000
9   Oct   8000
10  Nov   6000
11  Dec  19000

In [226]:
df1_la_sales.Date = df1_la_sales.Date + ' 2017'

In [227]:
df1_la_sales

        Date  Sales
0   JAN 2017   8000
1   Feb 2017  14000
2   Mar 2017  18000
3   Apr 2017   9000
4   May 2017  15000
5   Jun 2017   7700
6   Jul 2017  13500
7   Aug 2017  12000
8   Sep 2017   9000
9   Oct 2017   8000
10  Nov 2017   6000
11  Dec 2017  19000

In [228]:
df2_ny_sales

   Date     Sales
0   Jan  $10,000
1   Feb   12,000
2   Mar   11,000
3   Apr   10,000
4   May   15,000
5   Jun    9,000
6   Jul   10,000
7   Aug   11,000
8   Sep    9,000
9   Oct   13,000
10  Nov   16,000
11  Dex    9,000

In [235]:
df2_ny_sales.Sales = df2_ny_sales.Sales.str.lstrip('$')
df2_ny_sales.Sales = df2_ny_sales.Sales.str.lstrip('')
df2_ny_sales.Sales = df2_ny_sales.Sales.str.replace(',','')
df2_ny_sales.Sales = df2_ny_sales.Sales.apply(int)
df2_ny_sales.Date.loc[11] = "Dec"
df2_ny_sales.Date.loc[0] = "JAN"
df2_ny_sales.Date = df2_ny_sales.Date + ' 2017'

/Users/rigel/anaconda/lib/python3.6/site-packages/pandas/core/indexing.py:141: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._setitem_with_indexer(indexer, value)

In [236]:
df2_ny_sales

        Date  Sales
0   JAN 2017  10000
1   Feb 2017  12000
2   Mar 2017  11000
3   Apr 2017  10000
4   May 2017  15000
5   Jun 2017   9000
6   Jul 2017  10000
7   Aug 2017  11000
8   Sep 2017   9000
9   Oct 2017  13000
10  Nov 2017  16000
11  Dec 2017   9000

In [231]:
df1_la_sales

        Date  Sales
0   JAN 2017   8000
1   Feb 2017  14000
2   Mar 2017  18000
3   Apr 2017   9000
4   May 2017  15000
5   Jun 2017   7700
6   Jul 2017  13500
7   Aug 2017  12000
8   Sep 2017   9000
9   Oct 2017   8000
10  Nov 2017   6000
11  Dec 2017  19000

In [239]:
df3_stats = pd.DataFrame()

In [240]:
df3_stats['Date'] = df1_la_sales['Date']

In [241]:
df3_stats

        Date
0   JAN 2017
1   Feb 2017
2   Mar 2017
3   Apr 2017
4   May 2017
5   Jun 2017
6   Jul 2017
7   Aug 2017
8   Sep 2017
9   Oct 2017
10  Nov 2017
11  Dec 2017

In [242]:
df3_stats['LA Sales'] = df1_la_sales['Sales']
df3_stats['NY Sales'] = df2_ny_sales['Sales']
df3_stats['Total Sales'] = df3_stats['LA Sales'] + df3_stats['NY Sales']
df3_stats['Monthly Average Sale'] = df3_stats['Total Sales']/2

In [243]:
df3_stats

        Date  LA Sales  NY Sales  Total Sales  Monthly Average Sale
0   JAN 2017      8000     10000        18000                9000.0
1   Feb 2017     14000     12000        26000               13000.0
2   Mar 2017     18000     11000        29000               14500.0
3   Apr 2017      9000     10000        19000                9500.0
4   May 2017     15000     15000        30000               15000.0
5   Jun 2017      7700      9000        16700                8350.0
6   Jul 2017     13500     10000        23500               11750.0
7   Aug 2017     12000     11000        23000               11500.0
8   Sep 2017      9000      9000        18000                9000.0
9   Oct 2017      8000     13000        21000               10500.0
10  Nov 2017      6000     16000        22000               11000.0
11  Dec 2017     19000      9000        28000               14000.0

In [244]:
print("Total sales for LA and NY combined in 2017 = ",df3_stats['Total Sales'].sum())

Total sales for LA and NY combined in 2017 =  274200